# 缺失值处理

In [1]:
from sklearn.preprocessing import Imputer

In [3]:
df = DataFrame(np.random.randn(6,4),columns=['col1','col2','col3','col4'])
df.iloc[1:2,1] = np.nan
df.iloc[4,3] = np.nan
df

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465       NaN  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129       NaN
5 -0.388217 -1.110050  1.012914 -0.960552

In [4]:
df.isnull()

    col1   col2   col3   col4
0  False  False  False  False
1  False   True  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False   True
5  False  False  False  False

In [6]:
nan_model = Imputer(missing_values='NaN',strategy='mean',axis=0)
nan_result = nan_model.fit_transform(df)
nan_result

array([[ 2.18434061,  1.58190059,  0.83035621,  0.60905845],
       [-1.34746547,  0.20008323,  0.78959733,  1.35756791],
       [ 1.5307302 ,  0.69271874,  0.76107174,  0.80892494],
       [-0.20085478, -0.88117029, -0.84651227, -1.5298816 ],
       [-1.55016995,  0.7170172 ,  0.5351291 ,  0.05702361],
       [-0.38821708, -1.11005008,  1.01291378, -0.96055165]])

In [9]:
nan_result_pd1 = df.fillna(method='backfill')
nan_result_pd2 = df.fillna(method='bfill',limit=1)
nan_result_pd3 = df.fillna(method='pad')
nan_result_pd4 = df.fillna(0)
nan_result_pd5 = df.fillna({'col2':1.1,'col4':1.4})
nan_result_pd6 = df.fillna(df.mean()['col2':'col4'])
nan_result_pd1
nan_result_pd2
nan_result_pd3
nan_result_pd4
nan_result_pd5
nan_result_pd6

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465  0.692719  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129 -0.960552
5 -0.388217 -1.110050  1.012914 -0.960552

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465  0.692719  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129 -0.960552
5 -0.388217 -1.110050  1.012914 -0.960552

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465  1.581901  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129 -1.529882
5 -0.388217 -1.110050  1.012914 -0.960552

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465  0.000000  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129  0.000000
5 -0.388217 -1.110050  1.012914 -0.960552

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465  1.100000  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129  1.400000
5 -0.388217 -1.110050  1.012914 -0.960552

       col1      col2      col3      col4
0  2.184341  1.581901  0.830356  0.609058
1 -1.347465  0.200083  0.789597  1.357568
2  1.530730  0.692719  0.761072  0.808925
3 -0.200855 -0.881170 -0.846512 -1.529882
4 -1.550170  0.717017  0.535129  0.057024
5 -0.388217 -1.110050  1.012914 -0.960552

# 异常值处理

In [11]:
df = DataFrame({'col1':[1,120,3,5,2,12,13],
               'col2':[12,17,31,53,22,32,43]})
df

   col1  col2
0     1    12
1   120    17
2     3    31
3     5    53
4     2    22
5    12    32
6    13    43

In [13]:
((df - df.mean())/df.std()).abs()
((df - df.mean())/df.std()).abs() > 2.2

       col1      col2
0  0.491018  1.242118
1  2.254069  0.897085
2  0.444882  0.069007
3  0.398746  1.587151
4  0.467950  0.552052
5  0.237270  0.138013
6  0.214202  0.897085

    col1   col2
0  False  False
1   True  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False

# 重复值处理

In [14]:
data1 = ['a', 3]
data2 = ['b', 2]
data3 = ['a', 3]
data4 = ['c', 2]
df = pd.DataFrame([data1, data2, data3, data4], columns=['col1', 'col2'])
df

  col1  col2
0    a     3
1    b     2
2    a     3
3    c     2

In [17]:
df.duplicated(keep='first')

0    False
1    False
2     True
3    False
dtype: bool

In [18]:
df.drop_duplicates()  # 删除数据记录中所有列值相同的记录
df.drop_duplicates(['col1'])  # 删除数据记录中col1值相同的记录
df.drop_duplicates(['col2'])  # 删除数据记录中col2值相同的记录
df.drop_duplicates(['col1', 'col2'])  # 删除数据记录中指定列（col1/col2）值相同的记录

  col1  col2
0    a     3
1    b     2
3    c     2

  col1  col2
0    a     3
1    b     2
3    c     2

  col1  col2
0    a     3
1    b     2

  col1  col2
0    a     3
1    b     2
3    c     2

# 运用标志方法处理分类和顺序数据

In [19]:
from sklearn.preprocessing import OneHotEncoder

In [27]:
df = pd.DataFrame({'id': [3566841, 6541227, 3512441],
                   'sex': ['male', 'Female', 'Female'],
                   'level': ['high', 'low', 'middle']})
print (df)  # 打印输出原始数据框

# 自定义转换主过程
df_new = df.copy()  # 复制一份新的数据框用来存储转换结果
for col_num, col_name in enumerate(df):  # 循环读出每个列的索引值和列名
    col_data = df[col_name]  # 获得每列数据
    col_dtype = col_data.dtype  # 获得每列dtype类型
    if col_dtype == 'object':  # 如果dtype类型是object（非数值型），执行条件
        df_new = df_new.drop(col_name, 1)  # 删除df数据框中要进行标志转换的列
        value_sets = col_data.unique()  # 获取分类和顺序变量的唯一值域
        for value_unique in value_sets:  # 读取分类和顺序变量中的每个值
            col_name_new = col_name + '_' + value_unique  # 创建新的列名，使用原标题+值的方式命名
            col_tmp = df.iloc[:, col_num]  # 获取原始数据列
            new_col = (col_tmp == value_unique)  # 将原始数据列与每个值进行比较，相同为True，否则为False
            df_new[col_name_new] = new_col  # 为最终结果集增加新列值
print (df_new)  # 打印输出转换后的数据框

        id     sex   level
0  3566841    male    high
1  6541227  Female     low
2  3512441  Female  middle
        id  sex_male  sex_Female  level_high  level_low  level_middle
0  3566841      True       False        True      False         False
1  6541227     False        True       False       True         False
2  3512441     False        True       False      False          True

In [31]:
# 使用sklearn进行标志转换
df2 = pd.DataFrame({'id': [3566841, 6541227, 3512441],
                    'sex': [1, 2, 2],
                    'level': [3, 1, 2]})
id_data = df2.values[:, :1]  # 获得ID列
transform_data = df2.values[:, 1:]  # 指定要转换的列
enc = OneHotEncoder()  # 建立模型对象
df2_new = enc.fit_transform(transform_data).toarray()  # 标志转换
df2_all = pd.concat((pd.DataFrame(id_data), pd.DataFrame(df2_new)), axis=1)  # 组合为数据框
print (df2_all)  # 打印输出转换后的数据框

         0    0    1    2    3    4
0  3566841  1.0  0.0  0.0  0.0  1.0
1  6541227  0.0  1.0  1.0  0.0  0.0
2  3512441  0.0  1.0  0.0  1.0  0.0